cases/saturatedBox/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type        noSlipContinuous;
        value       uniform (0 0 0);
    }

    empties
    {
        type        empty;
    }
}
