cases/saturatedBox/0.org/Water2.dispersed
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water2.dispersed;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
