cases/saturatedBox/0.org/Water3.dispersed
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water3.dispersed;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    walls
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
