cases/saturatedBox/0.org/saturatedMixtureParams
S   1.0;

f
{
    Water1  0.333;
    Water2  0.666;
}

g
{
    Air     1.0;
}
