cases/saturatedBox/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}

activeSpecies
(
    Water1
    Water2
    Water3
);

inactiveSpecies
(
    Air
);

inertSpecie Air;

phaseMixing
{
    viscosity       continuousPhase;
    conductivity    mass;
    heatCapacity    mass;
}
