cases/saturatedBox/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.004;

vertices
(
    (0  0   0)
    (1  0   0)
    (1  1   0)
    (0  1   0)
    (0  0 0.01)
    (1  0 0.01)
    (1  1 0.01)
    (0  1 0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 32 1) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (0 3 4 7)
            (1 2 5 6)
            (2 3 7 6)
        );
    }

    empties
    {
        type empty;
        faces
        (
            (3 2 1 0)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
