cases/saturatedBox/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
    }

    pFinal
    {
        $p;
    }

    "(V|U|k|epsilon|omega|T|M|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
    }

    "(V|U|k|epsilon|omega|T|M|R)Final"
    {
        $U;
    }

    Y
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}
